tests/performance/results/TASK-007/01-baseline-disabled.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /perf/workload.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 12 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m00.7s/2m0s

running (0m02.0s), 10/10 VUs, 44 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m01.7s/2m0s

running (0m03.0s), 10/10 VUs, 79 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m02.7s/2m0s

running (0m04.0s), 10/10 VUs, 107 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m03.7s/2m0s

running (0m05.0s), 10/10 VUs, 138 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m04.7s/2m0s

running (0m06.0s), 10/10 VUs, 174 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m05.7s/2m0s

running (0m07.0s), 10/10 VUs, 202 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m06.7s/2m0s

running (0m08.0s), 10/10 VUs, 234 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m07.7s/2m0s

running (0m09.0s), 10/10 VUs, 266 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m08.7s/2m0s

running (0m10.0s), 10/10 VUs, 301 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m09.7s/2m0s

running (0m11.0s), 10/10 VUs, 331 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m10.7s/2m0s

running (0m12.0s), 10/10 VUs, 363 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m11.7s/2m0s

running (0m13.0s), 10/10 VUs, 395 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m12.7s/2m0s

running (0m14.0s), 10/10 VUs, 423 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m13.7s/2m0s

running (0m15.0s), 10/10 VUs, 460 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m14.7s/2m0s

running (0m16.0s), 10/10 VUs, 495 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m15.7s/2m0s

running (0m17.0s), 10/10 VUs, 529 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m16.7s/2m0s

running (0m18.0s), 10/10 VUs, 559 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m17.7s/2m0s

running (0m19.0s), 10/10 VUs, 588 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m18.7s/2m0s

running (0m20.0s), 10/10 VUs, 617 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m19.7s/2m0s

running (0m21.0s), 10/10 VUs, 646 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m20.7s/2m0s

running (0m22.0s), 10/10 VUs, 674 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m21.7s/2m0s

running (0m23.0s), 10/10 VUs, 701 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m22.7s/2m0s

running (0m24.0s), 10/10 VUs, 732 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m23.7s/2m0s

running (0m25.0s), 10/10 VUs, 764 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m24.7s/2m0s

running (0m26.0s), 10/10 VUs, 798 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m25.7s/2m0s

running (0m27.0s), 10/10 VUs, 829 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m26.7s/2m0s

running (0m28.0s), 10/10 VUs, 864 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m27.7s/2m0s

running (0m29.0s), 10/10 VUs, 895 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  0m28.7s/2m0s

running (0m30.0s), 10/10 VUs, 932 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m29.7s/2m0s

running (0m31.0s), 10/10 VUs, 961 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m30.7s/2m0s

running (0m32.0s), 10/10 VUs, 993 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m31.7s/2m0s

running (0m33.0s), 10/10 VUs, 1026 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m32.7s/2m0s

running (0m34.0s), 10/10 VUs, 1057 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m33.7s/2m0s

running (0m35.0s), 10/10 VUs, 1095 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  0m34.7s/2m0s

running (0m36.0s), 10/10 VUs, 1129 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m35.7s/2m0s

running (0m37.0s), 10/10 VUs, 1161 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m36.7s/2m0s

running (0m38.0s), 10/10 VUs, 1193 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m37.7s/2m0s

running (0m39.0s), 10/10 VUs, 1226 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m38.7s/2m0s

running (0m40.0s), 10/10 VUs, 1255 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m39.7s/2m0s

running (0m41.0s), 10/10 VUs, 1286 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  0m40.7s/2m0s

running (0m42.0s), 10/10 VUs, 1315 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m41.7s/2m0s

running (0m43.0s), 10/10 VUs, 1347 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  0m42.7s/2m0s

running (0m44.0s), 10/10 VUs, 1375 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  0m43.7s/2m0s

running (0m45.0s), 10/10 VUs, 1407 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m44.7s/2m0s

running (0m46.0s), 10/10 VUs, 1436 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m45.7s/2m0s

running (0m47.0s), 10/10 VUs, 1473 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  0m46.7s/2m0s

running (0m48.0s), 10/10 VUs, 1506 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m47.7s/2m0s

running (0m49.0s), 10/10 VUs, 1537 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  0m48.7s/2m0s

running (0m50.0s), 10/10 VUs, 1570 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  0m49.7s/2m0s

running (0m51.0s), 10/10 VUs, 1604 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m50.7s/2m0s

running (0m52.0s), 10/10 VUs, 1635 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m51.7s/2m0s

running (0m53.0s), 10/10 VUs, 1666 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  0m52.7s/2m0s

running (0m54.0s), 10/10 VUs, 1698 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m53.7s/2m0s

running (0m55.0s), 10/10 VUs, 1727 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  0m54.7s/2m0s

running (0m56.0s), 10/10 VUs, 1756 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  0m55.7s/2m0s

running (0m57.0s), 10/10 VUs, 1784 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m56.7s/2m0s

running (0m58.0s), 10/10 VUs, 1817 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m57.7s/2m0s

running (0m59.0s), 10/10 VUs, 1846 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  0m58.7s/2m0s

running (1m00.0s), 10/10 VUs, 1878 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  0m59.7s/2m0s

running (1m01.0s), 10/10 VUs, 1910 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  1m00.7s/2m0s

running (1m02.0s), 10/10 VUs, 1940 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  1m01.7s/2m0s

running (1m03.0s), 10/10 VUs, 1973 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  1m02.7s/2m0s

running (1m04.0s), 10/10 VUs, 2006 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  1m03.7s/2m0s

running (1m05.0s), 10/10 VUs, 2036 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  1m04.7s/2m0s

running (1m06.0s), 10/10 VUs, 2067 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  1m05.7s/2m0s

running (1m07.0s), 10/10 VUs, 2105 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  1m06.7s/2m0s

running (1m08.0s), 10/10 VUs, 2136 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  1m07.7s/2m0s

running (1m09.0s), 10/10 VUs, 2177 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  1m08.7s/2m0s

running (1m10.0s), 10/10 VUs, 2210 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  1m09.7s/2m0s

running (1m11.0s), 10/10 VUs, 2242 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  1m10.7s/2m0s

running (1m12.0s), 10/10 VUs, 2271 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  1m11.7s/2m0s

running (1m13.0s), 10/10 VUs, 2298 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  1m12.7s/2m0s

running (1m14.0s), 10/10 VUs, 2330 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  1m13.7s/2m0s

running (1m15.0s), 10/10 VUs, 2359 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  1m14.7s/2m0s

running (1m16.0s), 10/10 VUs, 2389 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  1m15.7s/2m0s

running (1m17.0s), 10/10 VUs, 2417 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  1m16.7s/2m0s

running (1m18.0s), 10/10 VUs, 2450 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  1m17.7s/2m0s

running (1m19.0s), 10/10 VUs, 2485 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  1m18.7s/2m0s

running (1m20.0s), 10/10 VUs, 2517 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  1m19.7s/2m0s

running (1m21.0s), 10/10 VUs, 2549 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  1m20.7s/2m0s

running (1m22.0s), 10/10 VUs, 2582 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  1m21.7s/2m0s

running (1m23.0s), 10/10 VUs, 2615 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  1m22.7s/2m0s

running (1m24.0s), 10/10 VUs, 2643 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  1m23.7s/2m0s

running (1m25.0s), 10/10 VUs, 2676 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  1m24.7s/2m0s

running (1m26.0s), 10/10 VUs, 2709 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  1m25.7s/2m0s

running (1m27.0s), 10/10 VUs, 2740 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  1m26.7s/2m0s

running (1m28.0s), 10/10 VUs, 2773 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  1m27.7s/2m0s

running (1m29.0s), 10/10 VUs, 2803 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  1m28.7s/2m0s

running (1m30.0s), 10/10 VUs, 2836 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  1m29.7s/2m0s

running (1m31.0s), 10/10 VUs, 2864 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  1m30.7s/2m0s

running (1m32.0s), 10/10 VUs, 2896 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  1m31.7s/2m0s

running (1m33.0s), 10/10 VUs, 2927 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  1m32.7s/2m0s

running (1m34.0s), 10/10 VUs, 2958 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  1m33.7s/2m0s

running (1m35.0s), 10/10 VUs, 2989 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  1m34.7s/2m0s

running (1m36.0s), 10/10 VUs, 3020 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  1m35.7s/2m0s

running (1m37.0s), 10/10 VUs, 3055 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  1m36.7s/2m0s

running (1m38.0s), 10/10 VUs, 3082 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  1m37.7s/2m0s

running (1m39.0s), 10/10 VUs, 3114 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  1m38.7s/2m0s

running (1m40.0s), 10/10 VUs, 3143 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  1m39.7s/2m0s

running (1m41.0s), 10/10 VUs, 3173 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  1m40.7s/2m0s

running (1m42.0s), 10/10 VUs, 3205 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  1m41.7s/2m0s

running (1m43.0s), 10/10 VUs, 3239 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  1m42.7s/2m0s

running (1m44.0s), 10/10 VUs, 3268 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  1m43.7s/2m0s

running (1m45.0s), 10/10 VUs, 3303 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  1m44.7s/2m0s

running (1m46.0s), 10/10 VUs, 3339 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  1m45.7s/2m0s

running (1m47.0s), 10/10 VUs, 3369 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  1m46.7s/2m0s

running (1m48.0s), 10/10 VUs, 3402 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  1m47.7s/2m0s

running (1m49.0s), 10/10 VUs, 3435 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  1m48.7s/2m0s

running (1m50.0s), 10/10 VUs, 3468 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  1m49.7s/2m0s

running (1m51.0s), 10/10 VUs, 3502 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  1m50.7s/2m0s

running (1m52.0s), 10/10 VUs, 3529 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  1m51.7s/2m0s

running (1m53.0s), 10/10 VUs, 3560 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  1m52.7s/2m0s

running (1m54.0s), 10/10 VUs, 3590 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  1m53.7s/2m0s

running (1m55.0s), 10/10 VUs, 3624 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  1m54.7s/2m0s

running (1m56.0s), 10/10 VUs, 3656 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  1m55.7s/2m0s

running (1m57.0s), 10/10 VUs, 3691 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  1m56.7s/2m0s

running (1m58.0s), 10/10 VUs, 3724 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  1m57.7s/2m0s

running (1m59.0s), 10/10 VUs, 3752 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  1m58.7s/2m0s

running (2m00.0s), 10/10 VUs, 3784 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  1m59.7s/2m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate==1.0' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=11.12ms
    ✓ 'p(99)<1000' p(99)=16.48ms

    unexpected_errors
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 11965   99.128398/s
    checks_succeeded...: 100.00% 11965 out of 11965
    checks_failed......: 0.00%   0 out of 11965

    ✓ detail: correct id
    ✓ detail: seeded version
    ✓ employee list: first page
    ✓ employee list: exactly own 120
    ✓ employee list: only own rows
    ✓ approver list: status filter holds
    ✓ approver list: department filter holds
    ✓ approver list: keyword filter holds
    ✓ approver list: page metadata consistent
    ✓ workflow: created DRAFT v0
    ✓ workflow: edited v1
    ✓ workflow: submitted PENDING v2
    ✓ workflow: decided v3
    ✓ workflow: detail shows final state
    ✓ workflow: stale approve is 409 version conflict

    CUSTOM
    expected_conflicts.............: 79     0.654504/s
    unexpected_errors..............: 0.00%  0 out of 6882

    HTTP
    http_req_duration..............: avg=6.9ms    min=3.08ms   med=6.06ms   p(90)=9.55ms   p(95)=11.12ms  p(99)=16.48ms  max=301.99ms
      { expected_response:true }...: avg=6.88ms   min=3.08ms   med=6.08ms   p(90)=9.56ms   p(95)=11.12ms  p(99)=16.27ms  max=301.99ms
    http_req_failed................: 1.14%  79 out of 6883
    http_reqs......................: 6883   57.024719/s

    EXECUTION
    iteration_duration.............: avg=315.94ms min=104.84ms med=317.58ms p(90)=474.29ms p(95)=493.99ms p(99)=523.63ms max=895.74ms
    iterations.....................: 3803   31.507338/s
    vus............................: 10     min=10         max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 9.5 MB 79 kB/s
    data_sent......................: 1.8 MB 15 kB/s



running (2m00.7s), 00/10 VUs, 3803 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  2m0s